/* Template for message displayed while preference panel is loading */
"Loading %@..." = "Ladataan: %@…";

/* Could not load preference message template */
"CouldNotLoad" = "Asetuspaneelia ”%@” ei voitu ladata.";
"CouldNotLoad_ArchMisMatch" = "Tämän tietokoneen asetuspaneelia %@ ei voida avata. Hanki uudempi versio ohjelmiston kehittäjältä.";
"CouldNotLoad_ArchMisMatch_PPC" = "Asetuksia %@ ei voida avata, koska ne eivät toimi PowerPC-pohjaisessa Macissa.";
"CouldNotLoad_ArchMisMatch_Intel" = "Asetuksia %@ ei voida avata, koska ne eivät toimi Intel-pohjaisessa Macissa.";

/* Preferences error alert title */
"Preferences Error" = "Virhe asetuksissa";

"OK" = "OK";
"CANCEL" = "Kumoa";
"REPLACE" = "Korvaa";

"SEARCH_LABEL" =  "Hae";
"SEARCH_PALLETE_LABEL" = "Hae";
"SHOWALL_LABEL" = "Näytä kaikki";
"BACK_AXDESCRIPTION" = "Taaksepäin";
"FORWARD_AXDESCRIPTION" = "Eteenpäin";
"AXScrollAreaDescription" = "asetuspaneelit";

/* Label for Show All button */
"Show All" = "Näytä kaikki";

/* Template for window title.  %@ is replaced by preference panel name */
"System Preferences - %@" = "Järjestelmäasetukset - %@";

/* Show All window title */
"System Preferences" = "Järjestelmäasetukset";

/* Truncation string */
"TRUNCATION_STRING" = "…";

/* Tooltips for MacManager disabled preference panes */
"MacManagerDisableLabel" = "Pääsysi tähän asetukseen on rajoitettu.";

/* Attempt to open disabled/hidden preference pane */
"PREF_PANE_HIDDEN_TITLE" = "Asetuspaneelia ”%@” ei voida avata, koska se ei ole käytettävissä tällä hetkellä.";
"PREF_PANE_HIDDEN_DESC" = "Nähdäksesi tämän asetuspaneelin, sinun tulee ehkä liittää laite tietokoneeseen.";

/* Install Assistant */
"PREF_PANE" = "asetuspaneeli";
"SCREEN_SAVER" = "näytönsäästäjä";

"PREF_PANE_INSTALL_ASSISTANT_MIN_VERS_TITLE" = "Et voi käyttää tätä asetuspaneelia Mac OS X:n tämän version kanssa.";
"SCREEN_SAVER_INSTALL_ASSISTANT_MIN_VERS_TITLE" = "Et voi käyttää tätä näytönsäästäjää Mac OS X:n tämän version kanssa.";
"PREF_PANE_INSTALL_ASSISTANT_MIN_VERS_DESC" = "Tämä asetuspaneeli vaatii version Mac OS X %@ tai uudemman. Tietokoneelle on asennettu versio Mac OS X %@.";
"SCREEN_SAVER_INSTALL_ASSISTANT_MIN_VERS_DESC" = "Tämä näytönsäästäjä vaatii version Mac OS X %@ tai uudemman. Tietokoneelle on asennettu versio Mac OS X %@.";

"PREF_PANE_INSTALL_ASSISTANT_CAPTION" = "Asetuspaneeli ”%@” on asennettava ennen kun sitä voidaan käyttää. Haluatko asentaa se nyt?";
"SCREEN_SAVER_INSTALL_ASSISTANT_CAPTION" = "Näytönsäästäjä ”%@” on asennettava ennen kun sitä voidaan käyttää. Haluatko asentaa se nyt?";

"INSTALL_ASSISTANT_AUTH_WARNING" = "Kun osoitat Asenna-painiketta, sinulta kysytään koneen ylläpitäjän käyttäjätunnus ja salasana.";

"UNINSTALL_ASSISTANT_ERR_TITLE" = "”%@” asetuspaneelia ei voida poistaa, koska tapahtui virhe.";

"PREF_PANE_INSTALL_ASSISTANT_EXISTS_TITLE" = "Asennettava asetuspaneeli on jo asennettu. Haluatko korvata asennetun asetuspaneelin?";
"PREF_PANE_INSTALL_ASSISTANT_EXISTS_TITLE_1" = "Vanhempi versio asetuspaneelista on jo asennettu. Haluatko korvata sen uudemmalla versiolla?";
"PREF_PANE_INSTALL_ASSISTANT_EXISTS_TITLE_2" = "Uudempi versio asetuspaneelista on jo asennettu. Haluatko korvata sen vanhemmalla versiolla?";

"SCREEN_SAVER_INSTALL_ASSISTANT_EXISTS_TITLE" = "Asennettava näytönsäästäjä on jo asennettu. Haluatko korvata asennetun näytönsäästäjän?";
"SCREEN_SAVER_INSTALL_ASSISTANT_EXISTS_TITLE_1" = "Vanhempi versio näytönsäästäjästä on jo asennettu. Haluatko korvata sen uudemmalla versiolla?";
"SCREEN_SAVER_INSTALL_ASSISTANT_EXISTS_TITLE_2" = "Uudempi versio näytönsäästäjästä on jo asennettu. Haluatko korvata sen vanhemmalla versiolla?";

"PREF_PANE_INSTALL_ASSISTANT_ERR_TITLE" = "Asetuspaneelia ”%@” ei voida asentaa, koska tapahtui virhe.";
"SCREEN_SAVER_INSTALL_ASSISTANT_ERR_TITLE" = "Näytönsäästäjää ”%@” ei voida asentaa, koska tapahtui virhe.";

"PREF_PANE_UNINSTALL_ASSISTANT_ERR_TITLE" = "Asetuspaneelia ”%@” ei voida poistaa, koska tapahtui virhe.";
"SCREEN_SAVER_UNINSTALL_ASSISTANT_ERR_TITLE" = "Näytönsäästäjää ”%@” ei voitu poistaa, koska tapahtui virhe.";

"PREF_PANE_INSTALL_ASSISTANT_APPLE_CONFLICT_TITLE" = "Asetuspaneelia ”%@” ei voida asentaa, koska se on jo asennettu.";
"PREF_PANE_INSTALL_ASSISTANT_APPLE_CONFLICT_DESC"= "Asetuspaneeli ”%@” tulee Mac OS X:n mukana eikä sitä voida korvata.";
"SCREEN_SAVER_INSTALL_ASSISTANT_APPLE_CONFLICT_TITLE" = "Näytönsäästäjää ”%@” ei voida asentaa, koska se on jo asennettu.";
"SCREEN_SAVER_INSTALL_ASSISTANT_APPLE_CONFLICT_DESC"= "Näytönsäästäjä ”%@” tulee Mac OS X:n mukana eikä sitä voida korvata.";
"INSTALL_REQUEST_REOPEN_APP" = "Kun olet asentanut ohjelman, lopeta Järjestelmäasetukset ja avaa se uudelleen.";

"PREF_PANE_INSTALL_ERROR" = "Asetuspaneelia ”%@” ei voitu asentaa.";
"SCREEN_SAVER_INSTALL_ERROR" = "Näytönsäästäjää ”%@” ei voitu asentaa.";

"REMOVE_PREF_CONTEXTUAL_MENU" = "Poista ”%@” asetuspaneeli";

"ERR_LOADING_MISSING_TITLE" = "Kohdetta ”%@” ei voida avata, koska se ei ole käytettävissä.";

/* Compatibility warning */
"WINDOW_TITLE_32BIT" = "%@ (32-bittinen)";
"ERR_LOADING_COMPATIBILITY_TITLE" = "Jotta voit käyttää ”%@” asetuspaneelia, Järjestelmäasetukset tulee sulkea ja avata uudelleen.";
